In [8]:
import pandas as pd
df = pd.read_csv(r"C:\Users\Admin\Desktop\titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [12]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)

df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [13]:
target=df.Survived
inputs=df.drop('Survived', axis='columns')

In [14]:
# convert sex text into number
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [17]:
#concat new columns into the original df
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male  female  male
0       3    male  22.0   7.2500       0     1       0     1
1       1  female  38.0  71.2833       1     0       1     0
2       3  female  26.0   7.9250       1     0       1     0
3       1  female  35.0  53.1000       1     0       1     0
4       3    male  35.0   8.0500       0     1       0     1

In [18]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male  female  male
0       3  22.0   7.2500       0     1       0     1
1       1  38.0  71.2833       1     0       1     0
2       3  26.0   7.9250       1     0       1     0
3       1  35.0  53.1000       1     0       1     0
4       3  35.0   8.0500       0     1       0     1

In [20]:
# see what columns have Na value

inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [23]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male  female  male
0       3  22.000000   7.2500       0     1       0     1
1       1  38.000000  71.2833       1     0       1     0
2       3  26.000000   7.9250       1     0       1     0
3       1  35.000000  53.1000       1     0       1     0
4       3  35.000000   8.0500       0     1       0     1
5       3  29.699118   8.4583       0     1       0     1

In [25]:
# data preprocessing: train test split

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [26]:
len(X_train)

712

In [27]:
len(X_test)

179

In [31]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [32]:
model.fit(X_train, y_train)

GaussianNB()

In [33]:
# measure accuracy

model.score(X_test, y_test)

0.8100558659217877

In [34]:
X_test[:10]

     Pclass        Age      Fare  female  male  female  male
44        3  19.000000    7.8792       1     0       1     0
359       3  29.699118    7.8792       1     0       1     0
835       1  39.000000   83.1583       1     0       1     0
91        3  20.000000    7.8542       0     1       0     1
438       1  64.000000  263.0000       0     1       0     1
88        1  23.000000  263.0000       1     0       1     0
246       3  25.000000    7.7750       1     0       1     0
684       2  60.000000   39.0000       0     1       0     1
165       3   9.000000   20.5250       0     1       0     1
691       3   4.000000   13.4167       1     0       1     0

In [35]:
y_test[:10]

44     1
359    1
835    1
91     0
438    0
88     1
246    0
684    0
165    1
691    1
Name: Survived, dtype: int64

In [38]:
# compare the predict output with y_test[:10]
model.predict(X_test[:10])

array([1, 1, 1, 0, 1, 1, 1, 0, 0, 1], dtype=int64)

In [40]:
model.predict_proba(X_test[:10])

array([[1.01373409e-03, 9.98986266e-01],
       [1.21836434e-03, 9.98781636e-01],
       [2.33732917e-05, 9.99976627e-01],
       [9.98923126e-01, 1.07687449e-03],
       [4.66413481e-11, 1.00000000e+00],
       [8.67738536e-17, 1.00000000e+00],
       [1.14761365e-03, 9.98852386e-01],
       [9.96316897e-01, 3.68310282e-03],
       [9.98498180e-01, 1.50181956e-03],
       [5.98665413e-04, 9.99401335e-01]])